Tekla Open API Reference for Tekla Structures 2025
BindPropertyNameEditor Constructor
Initializes a new instance of the BindPropertyNameEditor class
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BindPropertyNameEditor()
Public Sub New
See Also
Reference
BindPropertyNameEditor Class
Tekla.Structures.Dialog Namespace